app/controllers/emails_controller.rb

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @email = Email.find(params[:id])

INSERT INTO "emails" ("object", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["object", "You can get anything you want at Alice's restaurant."], ["created_at", "2020-11-19 11:32:30.109324"], ["updated_at", "2020-11-19 11:32:30.109324"]]
INSERT INTO "emails" ("object", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["object", "Is it not meningitis?"], ["created_at", "2020-11-19 14:47:48.647813"], ["updated_at", "2020-11-19 14:47:48.647813"]]
---
  def create
    @email = Email.create(object: Faker::Quote.famous_last_words)
    respond_to do |format|
      if @email.save

DELETE FROM "emails" WHERE "emails"."id" = $1  [["id", 1]]
---
  def destroy
    @email.destroy

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_email
      @email = Email.find(params[:id])